// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
//645 -> 5
//78 -> третьей цифры нет
//32679 -> 6

Console.WriteLine("Введите число: ");
String inputnumber = Console.ReadLine();
int number = int.Parse(inputnumber);

int Fun1(int number)
{
    if (number < 100)
    {
        console.WriteLine("Третья цифра числа отсутствует ");
    }
}
//int result1 = Fun1(number);
//int Fun2(int number)
//{
    //if (number > 100)
    //{

    //}
//}
int number = - number;
